{
  "title": "Exornata User Guide",
  "version": "1.0.0",
  "lastUpdated": "2025-10-28",
  "intro": "This guide summarizes the Exornata workflow described in the project paper. Each section maps to a practical task: explore the workspace, use constraint-driven editing, format and annotate structures, and deliver consistent outputs.",
  "sections": [
    {
      "id": "quick-start",
      "title": "Quick Start Workflow",
      "summary": "Load a structure, orient yourself, and try the first edits in under five minutes.",
      "content": [
        {
          "type": "paragraph",
          "text": "Use this checklist to move from an empty canvas to your first edits without getting overwhelmed."
        },
        {
          "type": "list",
          "style": "ordered",
          "items": [
            "The workspace initializes in *Edit* mode with a blank canvas.",
            "Select *Load example* to import the 5S ribosomal RNA structure of E.coli.",
            "The default constraint is Units/Complex, encompassing the entire structure, with drawing tools set to edit mode.",
            "Drag to reposition the entire structure. For precise edits, select a smaller region via the constraints menu.",
            "Switch to format mode to modify base pairs.",
            "Transition to annotate mode to apply labels.",
            "Export the edited structure as JSON, XRna, SVG, or other formats.",
            "Reload the exported structure to resume editing."
          ]
        },
        {
          "type": "note",
          "variant": "tip",
          "text": "For quick base pair editing, use middle mouse button to delete base pairs and ctrl + left click on two nucleotides to create a base pair."
        }
      ]
    },
    {
      "id": "workspace",
      "title": "Workspace Overview",
      "summary": "Understand how the navigation panel, canvas, and drawers cooperate during editing.",
      "content": [
        {
          "type": "paragraph",
          "text": "The workspace is split into focus areas so you always know where to look for the next action."
        },
        {
          "type": "table",
          "headers": [
            "Region",
            "Purpose",
            "Key actions"
          ],
          "rows": [
            [
              "Top Bar",
              "Session-level commands",
              "Opening and exporting files, toggling theme."
            ],
            [
              "Navigation Panel",
              "Mode-specific controls",
              "Switch constraints, tools (Edit / Format / Annotate), Basic utilities."
            ],
            [
              "Canvas",
              "Primary editing surface",
              "Modifying nucleotides positions, rotate constraints, modifying annotations."
            ],
            [
              "Floating Controls",
              "View management",
              "Zoom in/out, reset viewport, toggle view mode sequence/path, switch grid families."
            ],
            [
              "Properties Drawer",
              "Context inspector",
              "Tweak styling, annotations, or metadata for the current selection, specific to tool mode."
            ]
          ]
        }
      ],
      "subsections": [
        {
          "id": "workspace-drawers",
          "title": "Navigation Panel Breakdown",
          "summary": "Map the panel sections to the modules described in the manuscript.",
          "content": [
            {
              "type": "table",
              "headers": [
                "Panel section",
                "Matches paper section",
                "Highlights"
              ],
              "rows": [
                [
                  "Input / Output",
                  "Supported file formats",
                  "Import or export JSON, XRna legacy files, BPSeq lists, Traveler-compatible JSON."
                ],
                [
                  "Constraints",
                  "Constraints",
                  "Activate the hierarchy level you want to manipulate (single nucleotide → complex)."
                ],
                [
                  "Editing Tools",
                  "Editing mode",
                  "Translate, rotate, normalize, and freeze subsets with instant visual feedback."
                ],
                [
                  "Formatting",
                  "Formatting mode",
                  "Apply typography presets, recolor fragments, adjust stroke widths."
                ],
                [
                  "Annotate",
                  "Labeling, coloring",
                  "Increment residue labels, adjust leader lines, assign palettes."
                ],
                [
                  "Utilities",
                  "Utility box",
                  "Access grid toggles, autosave reminders, and legacy compatibility flags."
                ]
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "constraint-philosophy",
      "title": "Constraint Philosophy",
      "summary": "Hierarchy-aware constraints keep structural edits predictable.",
      "content": [
        {
          "type": "paragraph",
          "text": "Constraints span Four tiers: *Primitives* (nucleotide, base pair), *Fragments* (strand, helix, stacked, cycle), *Units* (domain, molecule, complex), *Scope* (Color & Scene)."
        },
        {
          "type": "table",
          "headers": [
            "Tier",
            "Constraints",
            "Definition"
          ],
          "rows": [
            [
              "Primitives",
              "Nucleotide, Base Pair",
              "The most basic units of RNA structure."
            ],
            [
              "Fragments",
              "Strand, Helix, Stacked, Cycle",
              "Groups of nucleotides that form secondary structure, motifs."
            ],
            [
              "Units",
              "Domain, Molecule, Complex",
              "Higher-order assemblies of RNA fragments."
            ],
            [
              "Scope",
              "Color & Scene",
              "Applies either colored region (User selected color) or the entire structure."
            ]
          ]
        },
        {
          "type": "note",
          "variant": "info",
          "text": "Cycle constraints automatically align junction nucleotides around a circle, honoring anchor selections as described in the paper's \"Editing mode\" section."
        }
      ],
      "subsections": [
        {
          "id": "constraint-deepdive",
          "title": "Understanding Constraint Modes",
          "summary": "Explore the constraints in detail.",
          "content": [
            {
              "type": "paragraph",
              "text": "The **Constraint Modes** in Exornata follow the same structural hierarchy used in XRNA. They describe the biological and graphical level of the RNA structure that will move or reshape together during editing. Each constraint corresponds to a recognized structural unit in RNA secondary structure representation."
            },
            {
              "type": "paragraph",
              "text": "**Primitives**"
            },
            {
              "type": "paragraph",
              "text": "*Includes: Nucleotide, Base Pair*"
            },
            {
              "type": "list",
              "style": "unordered",
              "items": [
                "**Nucleotide:** A nucleotide is a single RNA residue represented by one letter — 'A', 'U', 'G', 'C', or ambiguous symbols like 'R', 'Y', and 'N'. These are the default characters recognized by XRNA and Exornata. Each viewed nucleotide may have an associated nucleotide number (connected by a line or offset label). Moving a nucleotide in Exornata also translates its nucleotide number and label. Use this constraint to manipulate individual nucleotides when refining fine structural details.",
                "**Base Pair:** A base pair refers to two nucleotides that are hydrogen-bonded together. The 5′ nucleotide in a pair is called the 5′ side; the 3′ nucleotide is the 3′ side. Base pairs can be of any type (Watson–Crick, GU wobble, or noncanonical)."
              ]
            },
            {
              "type": "paragraph",
              "text": "**Fragments**"
            },
            {
              "type": "paragraph",
              "text": "*Includes: Strand, Helix, Stacked, Cycle*"
            },
            {
              "type": "list",
              "style": "unordered",
              "items": [
                "**Strand:** A single strand is a contiguous set of nucleotides that contains no base pairs. These regions are bounded by two single-strand delineators the nucleotides that mark the 5′ and 3′ ends of the unpaired segment. Delineators can be assigned automatically (based on natural pairing) or manually during editing. Single strands typically represent loops, bulges, and connecting regions between helices. Moving a strand repositions that entire unpaired segment between delineators.",
                "**Helix:** A helix refers to a contiguous set of base pairs. Even a single base pair can be considered a helix of length one. The start of a helix is defined by the base pair containing the most 5′ and most 3′ nucleotides; the end is the base pair on the opposite side of the stack. Helices may be drawn clockwise or counterclockwise, depending on representation. Moving a helix repositions the entire stack of base pairs as one rigid element.",
                "**Stacked Helix:** A stacked helix is a run of helices, connected 5′→3′, that are separated only by small cycles (loops or bulges) having one entry and one exit helix. For example, in the E. coli 5S rRNA, helices 16, 18, 28, and 31 form a stacked helix. A stacked helix does not have to be visually aligned it is defined topologically by continuous connectivity. Moving a stacked helix shifts all helices in that connected series together.",
                "**Cycle:** A cycle refers to any closed loop in the secondary structure graph a region enclosed by a continuous connection of helices and single-stranded segments. Cycles can represent hairpin loops, internal loops, or multi-helix junctions. For example, a simple hairpin loop helix forms a cycle where the closing base pair defines the 5′ and 3′ delineators of that loop. Editing a cycle moves the entire enclosed region (the loop and its connecting stems) as one topological unit. This makes it easy to reposition whole junctions or loops while maintaining overall structure integrity."
              ]
            },
            {
              "type": "paragraph",
              "text": "**Units**"
            },
            {
              "type": "paragraph",
              "text": "*Includes: Domain, Molecule, Complex*"
            },
            {
              "type": "list",
              "style": "unordered",
              "items": [
                "**Domain:** A domain includes a helix and all nucleotides extending in the 5′ direction back to the 3′ end of that same helix. In other words, it encompasses an entire local folding region of the RNA molecule. Moving a domain repositions that structured region and all its associated fragments as a cohesive block.",
                "**Molecule:** Represents an entire RNA strand all residues, base pairs, and subdomains within one chain. Moving a molecule repositions that complete RNA without changing its internal geometry.",
                "**Complex:** A set of multiple molecules that interact or are displayed together (for instance, rRNA with tRNA or mRNA). Editing at this level moves all molecules in the complex simultaneously."
              ]
            },
            {
              "type": "paragraph",
              "text": "**Scope**"
            },
            {
              "type": "paragraph",
              "text": "*Includes: Scene*"
            },
            {
              "type": "list",
              "style": "unordered",
              "items": [
                "**Color:** This is used for selecting similar colored fragments present in a continous region.",
                "**Scene:** The highest-level constraint. Moving the scene shifts everything currently visible in the workspace all molecules, annotations, and layout elements. This is typically used to reposition or center the full figure in the viewing window."
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "editing-mode",
      "title": "Editing Mode",
      "summary": "Manipulate topology while respecting RNA hierarchy.",
      "content": [
        {
          "type": "paragraph",
          "text": "Editing mode is where you reshape structures. Begin with a quick read of the tips below, then try them on a small selection."
        },
        {
          "type": "list",
          "style": "unordered",
          "items": [
            "Click-drag to reposition nucleotides or constrained subsets. Anchor points ensure arcs and cycles retain spacing.",
            "Right click to open properties panel for selected constrain group.",
            "Rotate base-paired fragments or entire domains when the constraint tier is set to Helix, Stacked Helix, or Domain.",
            "Freeze pivotal nucleotides with *Middle mouse click* so downstream drags leave them untouched.",
            "Normalize selected cycles to enforce even angular spacing and radiating helices."
          ]
        }
      ],
      "subsections": [
        {
          "id": "editing-anchors",
          "title": "UI actions",
          "summary": "Control the topology with UI actions.",
          "content": [
            {
              "type": "list",
              "style": "unordered",
              "items": [
                "Lock Constraints (Middle-click): Prevents constraints from any kind of modifications such as movement, rotation, etc.",
                "Prime (ctrl + click): Priming two nucleotides to create a base pair between them while honoring the existing constraints. While priming on base pairs breaks that base pair. Holding the shift button while priming will create a wobble base pair while priming forces repositioning of the nucleotides to create a base pair.",
                "Reformat (shift + R): Reformat the selected constraint by repositioning them based on the bonds lengths mentioned in the settings."
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "format-mode",
      "title": "Formatting Mode",
      "summary": "Configure base pairs, typography, and color with publication-ready output in mind.",
      "content": [
        {
          "type": "paragraph",
          "text": "Move into formatting mode once positions feel stable. Use the tools below to polish labels, colors, and base-pair presentation."
        }
      ],
      "subsections": [
        {
          "id": "format-mode-basepair-editor",
          "title": "Base Pair Editor",
          "summary": "Text-driven topology adjustments with CSV import/export.",
          "content": [
            {
              "type": "image",
              "src": "docs/images/bp_editor.png",
              "alt": "Base Pair Editor",
              "caption": "Base Pair Editor",
              "width": "en"
            },
            {
              "type": "paragraph",
              "text": "Open the editor from *Format → Base Pair Editor* to review nucleotide pairs, classify canonical, wobble, mismatch interactions, or assign Leontis–Westhof (LW) types. Use the export and import buttons to export existing basepair list as CSV or import a new basepair list. To add a base pair, choose *Add Base Pair*, select the relevant complex and molecules, and specify nucleotides 1 and 2. Select *Auto* to infer the type or override it with canonical, wobble, mismatch, or LW schema. Adjust the length to extend the pairing and enable repositioning to place the segment according to your configuration."
            },
            {
              "type": "paragraph",
              "text": "Use the action icons on the right to modify or delete individual base pairs as required."
            }
          ]
        }
      ]
    },
    {
      "id": "annotate-mode",
      "title": "Annotate Mode",
      "summary": "Label residues and tailor leader lines for presentations.",
      "content": [
        {
          "type": "paragraph",
          "text": "When you are ready to communicate findings, switch to annotate mode and refine the storytelling pieces first."
        },
        {
          "type": "list",
          "style": "unordered",
          "items": [
            "Increment labels across a range, shift numbering to match reference indexes, or hide indexes for presentation versions.",
            "Adjust label line curvature, stroke, and anchor positions to mirror the examples in the manuscript.",
            "Utilize the properties menu to finetune the labes for custom labeleing or increments."
          ]
        },
        {
          "type": "image",
          "src": "docs/images/annotate-panel.png",
          "alt": "Annotate mode panel with label settings",
          "caption": "Annotate mode exposes label offsets, numbering presets, and leader line adjustments side by side.",
          "width": "en"
        }
      ]
    },
    {
      "id": "file-formats",
      "title": "Supported File Formats",
      "summary": "Interoperate with legacy XRNA, R2DT, Traveler, and partner pipelines.",
      "content": [
        {
          "type": "paragraph",
          "text": "Reference this table before sending layouts to collaborators."
        },
        {
          "type": "table",
          "headers": [
            "Format",
            "Direction",
            "Notes"
          ],
          "rows": [
            [
              "JSON (Exornata schema)",
              "Import & Export",
              "Preferred format. Captures styling, constraints, and metadata referenced in the paper."
            ],
            [
              "SVG",
              "Import & Export",
              "Adobe illustrator ready format for users looking to add their own artworks."
            ],
            [
              "XRNA (legacy)",
              "Import & Export",
              "Maintains compatibility with the original desktop XRNA layouts."
            ],
            [
              "CSV",
              "Export",
              "Generates a CSV file with the nucleotide interactions list."
            ],
            [
              "TR (Traveler)",
              "Export",
              "Generates a Traveler file with the layout."
            ],
            [
              "BPSeq",
              "Export",
              "Generates a BPSeq file with the nucleotide interactions list."
            ]
          ]
        },
        {
          "type": "note",
          "variant": "tip",
          "text": "Switch the **Invert Y-axis** flag to align with external pipelines that flip the origin (R2DT, Traveler)."
        }
      ]
    },
    {
      "id": "json-schema",
      "title": "JSON Schema Essentials",
      "summary": "Encode complexes, molecules, nucleotides, labels, and base pairs for reproducible layouts.",
      "content": [
        {
          "type": "paragraph",
          "text": "Exornata uses the lab’s RNA 2D JSON specification. At the top level the file lists `classes` for reusable styling, then `rnaComplexes`, each containing `rnaMolecules`, sequences, and optional base-pair lists."
        },
        {
          "type": "list",
          "style": "unordered",
          "items": [
            "Nucleotides record `residueIndex`, `residueName`, `x`, `y`, plus optional `classes` for styling.",
            "Labels split into `labelContent` (text + coordinates) and `labelLine` (polyline). Coordinates are absolute to simplify manual adjustments.",
            "Base pairs stored at the molecule or complex level accept canonical, wobble, mismatch, or explicit Leontis–Westhof identifiers (e.g., `trans_watson_crick_hoogsteen`)."
          ]
        },
        {
          "type": "note",
          "variant": "info",
          "text": "The minimal JSON example from the paper is included in `public/docs/examples/minimal.json` for quick reference."
        }
      ]
   },
    
    {
      "id": "keybindings",
      "title": "Keybindings",
      "summary": "Actions you can reach without leaving the keyboard.",
      "content": [
        {
          "type": "paragraph",
          "text": "Keyboard shortcuts speed up routine tasks. Skim the table once, then revisit as you take on more advanced edits."
        },
        {
          "type": "table",
          "headers": [
            "Shortcut",
            "Scope",
            "Behavior"
          ],
          "rows": [
            [
              "Ctrl/cmd + O",
              "Global",
              "Open the file picker (browser prompt)."
            ],
            [
              "Ctrl/cmd + S",
              "Global",
              "Trigger the save/export dialog."
            ],
            [
              "Ctrl/cmd + 0",
              "Global",
              "Reset the viewport transform."
            ],
            [
              "Leftclick",
              "Global",
              "Select constraint group."
            ],
            [
              "Rightclick",
              "Global",
              "Open properties for selected constraint group."
            ],
            [
              "Ctrl/cmd + Z",
              "Global",
              "Undo last operation."
            ],
            [
              "Ctrl/cmd + Y",
              "Global",
              "Redo last undone operation."
            ],
            [
              "Middle Click",
              "Global",
              "Freezes nucleotides in the current selection."
            ],
            [
              "Ctrl/cmd + leftclick",
              "Global",
              "When clicked on a basepair breaks that basepair and when clicked on two nucleotides creates a basepair."
            ],
            [
              "Ctrl/cmd + shift + leftclick",
              "Global",
              "Creates a new basepair between two nucleotides with repositioning."
            ],
            [
              "Shift + R",
              "Global",
              "Repositions the selected constraint group."
            ]
          ]
        },
        {
          "type": "note",
          "variant": "info",
          "text": "Keyboard shortcuts are ignored while focus is inside editable text fields, consistent with the app's accessibility policy."
        }
      ]
    },
    {
      "id": "troubleshooting",
      "title": "Troubleshooting",
      "summary": "Resolve common issues encountered during long editing sessions.",
      "content": [
        {
          "type": "paragraph",
          "text": "If something feels off, match your symptom with the guidance below before altering the file in another tool."
        },
        {
          "type": "table",
          "headers": [
            "Symptom",
            "Likely cause",
            "Suggested fix"
          ],
          "rows": [
            [
              "Blank canvas after load",
              "Unsupported format or parse error",
              "Check browser console logs; validate against the JSON schema."
            ],
            [
              "Slow drags on large complexes",
              "Too many elements re-rendering",
              "Disable canvas grids."
            ],
            [
              "No properties in right drawer",
              "No active selection",
              "Select a constraint and click a nucleotide within that constraint group."
            ]
          ]
        }
      ]
    }
  ],
  "resources": [
    {
      "label": "Open issues",
      "url": "https://github.com/LDWLab/XRNA-React/issues",
      "description": "Report bugs or request features."
    },
    {
      "label": "RNA 2D JSON Schema",
      "url": "https://github.com/LDWLab/RNA2D-data-schema",
      "description": "Browse the source schema referenced by the guide."
    }
  ]
}