{
  "title": "Exornata User Guide",
  "version": "1.2.0",
  "lastUpdated": "2025-11-09",
  "intro": "This guide summarizes the Exornata workflow described in the project paper. Each section maps to a practical task: explore the workspace, use constraint-driven editing, format and annotate structures, and deliver consistent outputs.",
  "sections": [
    {
      "id": "quick-start",
      "title": "Quick Start Workflow",
      "summary": "Load a structure, orient yourself, and try the first edits in under five minutes.",
      "content": [
        {
          "type": "paragraph",
          "text": "Use this checklist to move from an empty canvas to your first edits without getting overwhelmed."
        },
        {
          "type": "list",
          "style": "ordered",
          "items": [
            "The workspace initializes in *Edit* mode with a blank canvas.",
            "Select *Load example* to import the 5S ribosomal RNA structure of E.coli.",
            "The default constraint is Units/Complex, encompassing the entire structure, with drawing tools set to edit mode.",
            "Drag to reposition the entire structure. For precise edits, select a smaller region via the constraints menu.",
            "Switch to format mode to modify base pairs.",
            "Transition to annotate mode to apply labels.",
            "Export the edited structure as JSON, XRna, SVG, or other formats.",
            "Reload the exported structure to resume editing."
          ]
        },
        {
          "type": "note",
          "variant": "tip",
          "text": "For quick base pair editing, use middle mouse button to delete base pairs and ctrl + left click on two nucleotides to create a base pair."
        }
      ]
    },
    {
      "id": "file-formats",
      "title": "Supported File Formats",
      "summary": "Interoperate with legacy Exornata, R2DT, Traveler, and partner pipelines.",
      "content": [
        {
          "type": "paragraph",
          "text": "Reference this table before sending layouts to collaborators."
        },
        {
          "type": "table",
          "headers": [
            "Format",
            "Direction",
            "Notes"
          ],
          "rows": [
            [
              "JSON (Exornata schema)",
              "Import & Export",
              "Preferred format. Captures styling, constraints, and metadata referenced in the paper."
            ],
            [
              "SVG",
              "Import & Export",
              "Adobe illustrator ready format for users looking to add their own artworks."
            ],
            [
              "XRNA (legacy)",
              "Import & Export",
              "Maintains compatibility with the original desktop XRNA layouts."
            ],
            [
              "FASTA",
              "Import",
              "Supports importing a FASTA file with or without secondary structure annotations (e.g., Vienna dot-bracket notation)."
            ],
            [
              "CSV",
              "Export",
              "Generates a CSV file with the nucleotide interactions list."
            ],
            [
              "TR (Traveler)",
              "Export",
              "Generates a Traveler file with the layout."
            ],
            [
              "BPSeq",
              "Export",
              "Generates a BPSeq file with the nucleotide interactions list."
            ]
          ]
        },
        {
          "type": "note",
          "variant": "tip",
          "text": "Switch the **Invert Y-axis** flag to align with external pipelines that flip the origin (R2DT, Traveler)."
        }
      ]
    },
    {
      "id": "workspace",
      "title": "Workspace Overview",
      "summary": "Understand how the navigation panel, canvas, and drawers cooperate during editing.",
      "content": [
        {
          "type": "paragraph",
          "text": "The workspace is split into focus areas so you always know where to look for the next action."
        },
        {
          "type": "table",
          "headers": [
            "Region",
            "Purpose",
            "Key actions"
          ],
          "rows": [
            [
              "Top Bar",
              "Session-level commands",
              "Opening and exporting files, toggling theme."
            ],
            [
              "Navigation Panel",
              "Mode-specific controls",
              "Switch constraints, tools (Edit / Format / Annotate), Basic utilities."
            ],
            [
              "Canvas",
              "Primary editing surface",
              "Modifying nucleotides positions, rotate constraints, modifying annotations."
            ],
            [
              "Floating Controls",
              "View management",
              "Zoom in/out, reset viewport, toggle view mode sequence/path, switch grid families."
            ],
            [
              "Properties Drawer",
              "Context inspector",
              "Tweak styling, annotations, or metadata for the current selection, specific to tool mode."
            ]
          ]
        }
      ],
      "subsections": [
        {
          "id": "workspace-drawers",
          "title": "Navigation Panel",
          "summary": "Map the panel sections to the modules described in the manuscript.",
          "content": [
            {
              "type": "paragraph",
              "text": "**Input / Output** (matches *Supported file formats*): Import or export JSON, XRna legacy files, BPSeq lists, dot-bracket (.dbn) notation, and Traveler-compatible JSON to move layouts between tools."
            },
            {
              "type": "paragraph",
              "text": "**Constraints** (matches *Constraints*): Activate the hierarchy level you want to manipulate—from single nucleotide to entire complex—before making structural edits."
            },
            {
              "type": "paragraph",
              "text": "**Editing Tools** (matches *Editing mode*): Translate, rotate, normalize, and freeze subsets with instant visual feedback while staying in the editing workflow."
            },
            {
              "type": "paragraph",
              "text": "**Formatting** (matches *Formatting mode*): Apply typography presets, recolor fragments, and adjust stroke widths to polish presentation."
            },
            {
              "type": "paragraph",
              "text": "**Annotate** (matches *Labeling, coloring*): Increment residue labels, adjust leader lines, and assign palettes for figure-ready callouts."
            },
            {
              "type": "paragraph",
              "text": "**Utilities** (matches *Utility box*): Access grid toggles, autosave reminders, and legacy compatibility flags that support longer sessions."
            }
          ]
        }
      ]
    },
    {
      "id": "constraint-philosophy",
      "title": "Constraint Philosophy",
      "summary": "Hierarchy-aware constraints keep structural edits predictable.",
      "content": [
        {
          "type": "paragraph",
          "text": "Constraints span Four tiers: *Primitives* (nucleotide, base pair), *Fragments* (strand, helix, stacked, cycle), *Units* (domain, molecule, complex), *Scope* (Color & Scene)."
        },
        {
          "type": "table",
          "headers": [
            "Tier",
            "Constraints",
            "Definition"
          ],
          "rows": [
            [
              "Primitives",
              "Nucleotide, Base Pair",
              "The most basic units of RNA structure."
            ],
            [
              "Fragments",
              "Strand, Helix, Stacked, Cycle",
              "Groups of nucleotides that form secondary structure, motifs."
            ],
            [
              "Units",
              "Domain, Molecule, Complex",
              "Higher-order assemblies of RNA fragments."
            ],
            [
              "Scope",
              "Color & Scene",
              "Applies either colored region (User selected color) or the entire structure."
            ]
          ]
        },
        {
          "type": "note",
          "variant": "info",
          "text": "Cycle constraints automatically align junction nucleotides around a circle, honoring anchor selections as described in the paper's \"Editing mode\" section."
        }
      ],
      "subsections": [
        {
          "id": "constraint-deepdive",
          "title": "Constraint Modes",
          "summary": "Explore the constraints in detail.",
          "content": [
            {
              "type": "paragraph",
              "text": "The **Constraint Modes** in Exornata follow the same structural hierarchy used throughout Exornata. They describe the biological and graphical level of the RNA structure that will move or reshape together during editing. Each constraint corresponds to a recognized structural unit in RNA secondary structure representation."
            },
            {
              "type": "paragraph",
              "text": "**Primitives**"
            },
            {
              "type": "paragraph",
              "text": "*Includes: Nucleotide, Base Pair*"
            },
            {
              "type": "list",
              "style": "unordered",
              "items": [
                "**Nucleotide:** A nucleotide is a single RNA residue represented by one letter — 'A', 'U', 'G', 'C', or ambiguous symbols like 'R', 'Y', and 'N'. These are the default characters recognized by Exornata. Each viewed nucleotide may have an associated nucleotide number (connected by a line or offset label). Moving a nucleotide in Exornata also translates its nucleotide number and label. Use this constraint to manipulate individual nucleotides when refining fine structural details.",
                "**Base Pair:** A base pair refers to two nucleotides that are hydrogen-bonded together. The 5′ nucleotide in a pair is called the 5′ side; the 3′ nucleotide is the 3′ side. Base pairs can be of any type (Watson–Crick, GU wobble, or noncanonical)."
              ]
            },
            {
              "type": "paragraph",
              "text": "**Fragments**"
            },
            {
              "type": "paragraph",
              "text": "*Includes: Strand, Helix, Stacked, Cycle*"
            },
            {
              "type": "list",
              "style": "unordered",
              "items": [
                "**Strand:** A single strand is a contiguous set of nucleotides that contains no base pairs. These regions are bounded by two single-strand delineators the nucleotides that mark the 5′ and 3′ ends of the unpaired segment. Delineators can be assigned automatically (based on natural pairing) or manually during editing. Single strands typically represent loops, bulges, and connecting regions between helices. Moving a strand repositions that entire unpaired segment between delineators.",
                "**Helix:** A helix refers to a contiguous set of base pairs. Even a single base pair can be considered a helix of length one. The start of a helix is defined by the base pair containing the most 5′ and most 3′ nucleotides; the end is the base pair on the opposite side of the stack. Helices may be drawn clockwise or counterclockwise, depending on representation. Moving a helix repositions the entire stack of base pairs as one rigid element.",
                "**Stacked Helix:** A stacked helix is a run of helices, connected 5′→3′, that are separated only by small cycles (loops or bulges) having one entry and one exit helix. For example, in the E. coli 5S rRNA, helices 16, 18, 28, and 31 form a stacked helix. A stacked helix does not have to be visually aligned it is defined topologically by continuous connectivity. Moving a stacked helix shifts all helices in that connected series together.",
                "**Cycle:** A cycle refers to any closed loop in the secondary structure graph a region enclosed by a continuous connection of helices and single-stranded segments. Cycles can represent hairpin loops, internal loops, or multi-helix junctions. For example, a simple hairpin loop helix forms a cycle where the closing base pair defines the 5′ and 3′ delineators of that loop. Editing a cycle moves the entire enclosed region (the loop and its connecting stems) as one topological unit. This makes it easy to reposition whole junctions or loops while maintaining overall structure integrity."
              ]
            },
            {
              "type": "paragraph",
              "text": "**Units**"
            },
            {
              "type": "paragraph",
              "text": "*Includes: Domain, Molecule, Complex*"
            },
            {
              "type": "list",
              "style": "unordered",
              "items": [
                "**Domain:** A domain includes a helix and all nucleotides extending in the 5′ direction back to the 3′ end of that same helix. In other words, it encompasses an entire local folding region of the RNA molecule. Moving a domain repositions that structured region and all its associated fragments as a cohesive block.",
                "**Molecule:** Represents an entire RNA strand all residues, base pairs, and subdomains within one chain. Moving a molecule repositions that complete RNA without changing its internal geometry.",
                "**Complex:** A set of multiple molecules that interact or are displayed together (for instance, rRNA with tRNA or mRNA). Editing at this level moves all molecules in the complex simultaneously."
              ]
            },
            {
              "type": "paragraph",
              "text": "**Scope**"
            },
            {
              "type": "paragraph",
              "text": "*Includes: Scene*"
            },
            {
              "type": "list",
              "style": "unordered",
              "items": [
                "**Color:** This is used for selecting similar colored fragments present in a continous region.",
                "**Scene:** The highest-level constraint. Moving the scene shifts everything currently visible in the workspace all molecules, annotations, and layout elements. This is typically used to reposition or center the full figure in the viewing window."
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "editing-mode",
      "title": "Editing Mode",
      "summary": "Manipulate topology while respecting RNA hierarchy.",
      "content": [
        {
          "type": "paragraph",
          "text": "The **Edit** tab inside Drawing Tools reshapes the visual layout of the RNA secondary structure according to the active Constraint Mode."
        },
        {
          "type": "paragraph",
          "text": "Editing does not change base-pair connectivity or sequence data—it strictly adjusts geometry, spacing, and overall positioning so layouts read clearly."
        },
        {
          "type": "paragraph",
          "text": "Use this mode to refine helices, loops, and individual residues until the diagram communicates the structure with balanced spacing and symmetry."
        },
        {
          "type": "paragraph",
          "text": "**Demonstrating Edit Functions**"
        }
      ],
      "subsections": [
        {
          "id": "edit-move-nucleotide",
          "title": "Nucleotide",
          "content": [
            {
              "type": "image",
              "src": "docs/images/nt_move.png",
              "alt": "Dragging a single nucleotide in Edit mode",
              "caption": "Move a single nucleotide",
              "width": "lg",
              "figureId": "fig-1"
            },
            {
              "type": "paragraph",
              "text": "**Move a single nucleotide:** Switch Constraint Mode to *Primitives → Nucleotide* and activate the Edit tab. Click and drag a nucleotide to reposition it, then use Undo or Restore (Drawing Tools) if you need to revert."
            }
          ]
        },
        {
          "id": "edit-move-strand",
          "title": "Strand",
          "content": [
            {
              "type": "image",
              "src": "docs/images/strand_move.png",
              "alt": "Translating an entire strand segment",
              "caption": "Move a single strand",
              "width": "lg",
              "figureId": "fig-2"
            },
            {
              "type": "paragraph",
              "text": "**Move a single strand:** Set Constraint Mode to *Fragments → Strand*. Drag any nucleotide inside the single-stranded region you want to reposition; only the residues between the strand's 5′ and 3′ delineators will move."
            }
          ]
        },
        {
          "id": "edit-anchor-strand",
          "title": "Strand Anchor Points",
          "content": [
            {
              "type": "image",
              "src": "docs/images/anchored_move.png",
              "alt": "Anchoring two nucleotides before bending a strand",
              "caption": "Shape a strand with anchor points",
              "width": "lg",
              "figureId": "fig-3"
            },
            {
              "type": "paragraph",
              "text": "**Shape a strand with anchor points:** Temporarily switch back to *Primitives → Nucleotide* and middle-click two noncontiguous nucleotides in the strand to anchor them (each displays a red ring). Return to *Fragments → Strand*, then drag a nucleotide between the anchors to bend that portion while the anchored ends stay fixed."
            }
          ]
        },
        {
          "id": "edit-move-helix",
          "title": "Helix",
          "content": [
            {
              "type": "image",
              "src": "docs/images/helix_move.png",
              "alt": "Repositioning a cycle constraint",
              "caption": "Move Helix",
              "width": "lg",
              "figureId": "fig-4"
            },
            {
              "type": "image",
              "src": "docs/images/helix_advance.png",
              "alt": "Rotating and translating a helix",
              "caption": "Rotate a helix and Advance options",
              "width": "lg",
              "figureId": "fig-5"
            },
            {
              "type": "paragraph",
              "text": "**Move and rotate a helix:** Choose *Fragments → Helix*. Drag any nucleotide in the helix to translate the entire stack. For precise adjustments, right-click a nucleotide to open the Properties Panel, expand the Positions tab, tweak x/y to move, and adjust θ to rotate around the helix centroid."
            }
          ]
        },
        {
          "id": "edit-reposition-cycle",
          "title": "Cycle",
          "content": [
            {
              "type": "paragraph",
              "text": "**Reposition a cycle:** Set Constraint Mode to *Fragments → Cycle*. Select the closed loop you want to normalize—Exornata redistributes the connected helices and strands around the lowest-numbered anchor helix. Drag the cycle boundary after repositioning to widen or tighten the loop for the desired spacing."
            }
          ]
        }
      ]
    },
    {
      "id": "format-mode",
      "title": "Format Mode",
      "summary": "Change base-pairing relationships without leaving the Drawing Tools workflow.",
      "content": [
        {
          "type": "paragraph",
          "text": "Move into formatting mode once positions feel stable. Use the tools below to polish labels, colors, and base-pair presentation."
        },
        {
          "type": "paragraph",
          "text": "The Format tab under Drawing Tools in Exornata is used to modify the base-pairing relationships within an RNA molecule. Unlike the Edit mode, which only adjusts geometry and layout, the Format mode directly changes which nucleotides are paired — effectively altering the secondary structure. Use this mode when you need to add, delete, or redefine base pairs in your RNA model."
        },
        {
          "type": "image",
          "src": "docs/images/bp_editor.png",
          "alt": "Base Pair Editor",
          "caption": "Base Pair Editor",
          "width": "lg",
          "figureId": "fig-6"
        }
      ],
      "subsections": [
        {
          "id": "format-mode-basepair-editor",
          "title": "Base Pair Editor",
          "summary": "Text-driven topology adjustments with CSV import/export.",
          "content": [
            {
              "type": "paragraph",
              "text": "Open the editor from *Format → Base Pair Editor* to review nucleotide pairs, classify canonical, wobble, mismatch interactions, or assign Leontis–Westhof (LW) types. Use the export and import buttons to export existing basepair list as CSV or import a new basepair list. To add a base pair, choose *Add Base Pair*, select the relevant complex and molecules, and specify nucleotides 1 and 2. Select *Auto* to infer the type or override it with canonical, wobble, mismatch, or LW schema. Adjust the length to extend the pairing and enable repositioning to place the segment according to your configuration."
            },
            {
              "type": "paragraph",
              "text": "Use the action icons on the right to modify or delete individual base pairs as required."
            }
          ]
        },
        {
          "id": "format-tool-interactive",
          "title": "UI Mode",
          "summary": "Create, remove, or realign base pairs directly on the canvas.",
          "content": [
            {
              "type": "paragraph",
              "text": "Under any Constraint Mode or Drawing Tools, hold Ctrl and left-click on an unpaired nucleotide. A blue circle will appear around the selected nucleotide, indicating it is pair-ready."
            },
            {
              "type": "paragraph",
              "text": "To cancel pairing, simply left-click anywhere else or Ctrl + left-click the same nucleotide again to deselect it."
            },
            {
              "type": "paragraph",
              "text": "With one nucleotide marked as pair-ready (blue circle), hold Ctrl and left-click on another unpaired nucleotide. A base pair will be created between the two selected nucleotides."
            },
            {
              "type": "paragraph",
              "text": "A symbol will appear between them — for example, an open circle indicates a noncanonical pair (such as an A–C pairing)."
            },
            {
              "type": "paragraph",
              "text": "To delete a base pair, hold Ctrl and left-click on the pairing symbol located between the two paired nucleotides — for example, the open circle representing a noncanonical pair — to remove that base pair."
            },
            {
              "type": "paragraph",
              "text": "Adding a base pair using Ctrl + Left-click will only establish the base-pair relationship without changing the positions of the two selected nucleotides."
            },
            {
              "type": "paragraph",
              "text": "If you use Ctrl + Shift + Left-click on two unpaired nucleotides, this will both create the base pair and reposition the nucleotides so that the distance between them matches the default base-pair spacing, which depends on the pairing type:"
            },
            {
              "type": "list",
              "style": "unordered",
              "items": [
                "Base-pair distance: standard for Watson–Crick and wobble pairs",
                "Mismatch distance: 20% longer than the standard base-pair distance"
              ]
            },
            {
              "type": "paragraph",
              "text": "The interactive mode allows you to interactively add, delete, and realign base pairs or helices directly on the canvas."
            },
            {
              "type": "note",
              "variant": "info",
              "text": "Noncanonical base pairs are treated as unpaired by default."
            }
          ]
        },
        {
          "id": "format-tool-basepair-editor",
          "title": "BP Editor mode",
          "summary": "Specify nucleotide indices numerically to build or correct helices.",
          "content": [
            {
              "type": "paragraph",
              "text": "The Base-Pair Editor provides a precise way to define or modify base-pairing relationships numerically rather than by direct clicking. Use this tool when you want to build or correct helices systematically, especially in large or complex RNAs."
            },
            {
              "type": "image",
              "src": "docs/images/bp_editor.png",
              "alt": "Opening the Base-Pair Editor from the Format tab",
              "caption": "Open the Base-Pair Editor",
              "width": "lg",
              "figureId": "fig-14"
            },
            {
              "type": "paragraph",
              "text": "Let’s start with adding a new base pair with the Base-Pair Editor. Click on the Format tab under Drawing Tools (you can do this under any Constraint Mode). Then, right-click on the nucleotide you want to pair — this will open the Base-Pair Editor window at the bottom of the screen."
            },
            {
              "type": "paragraph",
              "text": "Next, hover your cursor over the two nucleotides you wish to pair to view their nucleotide indices. In the Base-Pair Editor window, click Add Base Pair, then type the nucleotide numbers of the two bases you want to connect (for example, 12 for cytosine #12 and 109 for adenine #109). Click Add to create the base pair between the specified nucleotides."
            },
            {
              "type": "paragraph",
              "text": "The new pairing will immediately appear on the canvas and be listed in the Base-Pair Editor table below."
            }
          ]
        },
        {
          "id": "format-tool-helix",
          "title": "Helix Creation",
          "summary": "Generate multi-pair helices without adding each pair manually.",
          "content": [
            {
              "type": "paragraph",
              "text": "Once you have created individual base pairs, you can extend them into a helix directly from the Base-Pair Editor. This is especially useful for rebuilding or correcting helical regions in large RNA structures."
            },
            {
              "type": "paragraph",
              "text": "In Format mode, you can quickly reconstruct an entire helix instead of adding base pairs one by one. Right-click on any nucleotide in an unpaired region where you want to build a helix. This opens the Base-Pair Editor window at the bottom of the screen."
            },
            
            {
              "type": "paragraph",
              "text": "In the Base-Pair Editor window, click on the Helices tab in the upper-left corner. This view lets you define a helix by specifying its starting and ending nucleotides and total length. Click Add Base Pair again to define a new helix."
            },
            {
              "type": "paragraph",
              "text": "In this example, we’ll reconstruct a 10-base-pair helix between nucleotide #1 and nucleotide #119. Enter:"
            },
            {
              "type": "list",
              "style": "unordered",
              "items": [
                "NT (Index) A → 1 (lowest-numbered nucleotide in the helix)",
                "NT (Index) B → 119 (highest-numbered nucleotide in the helix)",
                "Length → 10 (number of base pairs)"
              ]
            },
            
            {
              "type": "paragraph",
              "text": "Click Add to generate the helix. The new helix will appear on the canvas, and its definition will be listed in the Helices table."
            }
          ]
        }
      ]
    },
    {
      "id": "annotate-mode",
      "title": "Annotate Mode",
      "summary": "Label residues and tailor leader lines for presentations.",
      "content": [
        {
          "type": "paragraph",
          "text": "The Annotation Mode in Exornata adds index labels to RNA structures to help track nucleotide positions, helices, or specific regions. This feature currently supports only numerical labeling, not text comments or highlighting."
        }
      ],
      "subsections": [
        {
          "id": "annotate-scope",
          "title": "Setting Up Scope",
          "summary": "Choose which region of the RNA to annotate.",
          "content": [
            {
              "type": "image",
              "src": "docs/images/annotate_panel.png",
              "alt": "Annotation properties panel",
              "caption": "Annotation parameters in the Properties Panel",
              "width": "lg",
              "figureId": "fig-20"
            },
            {
              "type": "paragraph",
              "text": "Start by defining which region of the RNA you want to annotate. In the Constraint Modes panel, select Units → Molecule to annotate the entire RNA structure."
            },
            {
              "type": "paragraph",
              "text": "In this example, the selected region is the complete 5S rRNA molecule with the right stack annotated."
            }
          ]
        },
        {
          "id": "annotate-parameters",
          "title": "Configuring Parameters",
          "summary": "Configure Start Index, Increment, Override Start, and End Index.",
          "content": [
            {
              "type": "paragraph",
              "text": "Click Annotate under Drawing Tools, then right-click anywhere on the molecule to open the Properties Panel for annotation. You'll see fields for Start Index, Increment, Override Start, and End Index."
            },
            {
              "type": "list",
              "style": "unordered",
              "items": [
                "Start Index — Defines the first nucleotide in your labeling sequence.",
                "Increment — Controls how frequently labels appear (e.g., every 10th nucleotide).",
                "Override Start (Optional) — Specifies the displayed number of the first label (useful for fragments within a larger molecule).",
                "End Index (Optional) — Defines where labeling stops (leave blank to annotate the entire selected region)."
              ]
            },
            {
              "type": "paragraph",
              "text": "Examples: in [fig-20], The Start Index (16) is Overridden (Override Start = 1), so labels appear as 1, 11, 21, 31, and so on till end index."
            }
          ]
        },
        {
          "id": "annotate-apply",
          "title": "Apply the Labels",
          "summary": "Generate index labels along the selected region.",
          "content": [
            {
              "type": "paragraph",
              "text": "Once the settings are defined, click Create Annotations. Exornata will automatically add numbered labels at every Nth nucleotide along the molecule based on your increment."
            }
          ]
        },
        {
          "id": "annotate-edit",
          "title": "Editing Labels After Creation",
          "summary": "Reposition labels or modify appearance via the Properties Panel.",
          "content": [
            {
              "type": "image",
              "src": "docs/images/annotate_transform.png",
              "alt": "Labels created along the molecule with guide lines",
              "caption": "Labels with leader lines for clarity",
              "width": "lg",
              "figureId": "fig-21"
            },
            {
              "type": "paragraph",
              "text": "After generating index annotations, you can modify or reposition them using the Edit tool. Click Edit under Drawing Tools to exit Annotation Mode."
            },
            {
              "type": "paragraph",
              "text": "Reposition labels by clicking and dragging any label to adjust its position. The labels will move freely without affecting the underlying RNA structure."
            },
            {
              "type": "paragraph",
              "text": "To edit label appearance, right-click on any label in Edit mode to open its properties in the Properties Panel. Expand the Color, Font, or Positions tabs to recolor text and lines, adjust font size or orientation, or tweak position offsets (x, y, θ, scale)."
            }
          ]
        }
      ]
    },
    {
      "id": "json-schema",
      "title": "JSON Schema",
      "summary": "Encode complexes, molecules, nucleotides, labels, and base pairs for reproducible layouts.",
      "content": [
        {
          "type": "paragraph",
          "text": "Exornata uses a specialized RNA 2D JSON format developed in the lab GitHub - LDWLab/RNA2D-data-schema. The JSON schema facilitates the integration with other resources R2DT (R2DT Bio), Traveler, and RiboVision2, previously developed by the members of RNAconsortium. Such integration enables the community to produce, edit and deposit the standardized RNA layouts into R2DT, a template-based pipeline for generating the secondary-structure layouts. This novel format encodes all the information required by Exornata to model a complex scene of RNA molecules, as well as the style information necessary for visual display."
        },
        {
          "type": "code",
          "language": "json",
          "label": "Minimal valid XRNA-React JSON file",
          "content": "{\n  \"classes\" : [\n    {\n      \"name\" : \"myStyleA\",\n      \"color\" : \"#FF0000\"\n    },\n    {\n      \"name\" : \"myStyleT\",\n      \"color\" : \"#00FF00\"\n    }\n  ],\n  \"rnaComplexes\" : [{\n    \"name\" : \"myRnaComplex\",\n    \"rnaMolecules\" : [{\n      \"name\" : \"myRnaMolecule\",\n      \"sequence\" : [\n        {\n          \"residueIndex\" : 1,\n          \"residueName\" : \"A\",\n          \"x\" : 0,\n          \"y\" : 0,\n          \"classes\" : [\"myStyleA\"]\n        },\n        {\n          \"residueIndex\" : 2,\n          \"residueName\" : \"T\",\n          \"x\" : 10,\n          \"y\" : 0,\n          \"classes\" : [\"myStyleT\"]\n        }\n      ],\n      \"labels\" : [],\n      \"basePairs\" : [\n        {\n          \"residueIndex1\" : 1,\n          \"residueIndex2\" : 2,\n          \"basePairType\" : \"canonical\"\n        }\n      ]\n    }]\n  }]\n}"
        }
      ],
      "subsections": [
        {
          "id": "json-schema-hierarchy",
          "title": "Hierarchy",
          "content": [
            {
              "type": "paragraph",
              "text": "At the top level of the data model are the RNA complexes. RNA complexes contain one or more RNA molecules, which in turn contain one or more nucleotides. RNA complexes may list all of the base pairs within the complex (either inter-molecular or intra-molecular base pairs). Alternatively, RNA molecules may specify all base pairs which are present therein (intramolecular base pairs)."
            }
          ]
        },
        {
          "id": "json-schema-styling",
          "title": "Styling",
          "content": [
            {
              "type": "paragraph",
              "text": "To minimize the file size of our JSON files and simplify style management, a top-level CSS-like “classes” array property facilitates styling of visual elements.The names of these optional properties are follow standard CSS conventions: “font-family,” “font-size,” “font-weight,” “font-style,” “stroke,” “stroke-width,” and “color”. The one required property of each entry in “classes” is “name.” The name property enables other elements in the file to be styled according to corresponding “name” properties. Alternatively, the following elements may optionally specify their own individual “classes” property (string array): base pairs, nucleotides, label-content objects and label-line objects."
            }
          ]
        },
        {
          "id": "json-schema-rna-complex",
          "title": "RNA complex",
          "content": [
            {
              "type": "paragraph",
              "text": "The rest of the file defines a hierarchical structure under the property “rnaComplexes.” This array object describes all RNA complexes present within the scene. All files must describe at least one RNA complex, even if the file contains only a single RNA molecule. RNA-complex objects may contain an optional “basePairs” property which describes the base pairs which exist between RNA molecules within the current RNA complex. For these base-pair objects, the following are required properties: “rnaMoleculeName1” (string), “rnaMoleculeName2” (string), “residueIndex1” (integer), “residueIndex2” (integer). Each pair (rnaMoleculeName1, residueIndex1) and (rnaMoleculeName2, residueIndex2) are keys which must match RNA-molecule names found within the current RNA complex and nucleotides within the corresponding RNA molecules. All strings within this file are case-sensitive, with the possible exception of font attributes."
            }
          ]
        },
        {
          "id": "json-schema-base-pair",
          "title": "Base Pair",
          "content": [
            {
              "type": "paragraph",
              "text": "Optional properties of each base-pair object include “stroke-width” (floating-point number), “stroke” (a CSS color), “color” (a CSS color) and “basePairType” (string). If “basePairType” is not provided, the type will be inferred according to the nucleotides present within the base pair. The resultant base-pair type will be one of “canonical,” “wobble” or “mismatch.” The user may explicitly specify base-pair types based on Leontis-Westhof rules."
            }
          ]
        },
        {
          "id": "json-schema-rna-molecule",
          "title": "RNA molecule",
          "content": [
            {
              "type": "paragraph",
              "text": "The required properties of each RNA-complex object are “name” and “rnaMolecules.” The “name” property acts as a case-sensitive unique identifier for each RNA complex. The “rnaMolecules” array property must contain at least one RNA-molecule object."
            },
            {
              "type": "paragraph",
              "text": "Each RNA-molecule object requires the following properties: “name,” “labels,” and “sequence.” The name property acts as a case-sensitive unique identifier for each RNA molecule. The “labels”array property facilitates labeling of nucleotides. The “sequence” array property lists the nucleotides present in the current RNA molecule. Optional properties include “classesForLabels” (string array) and “classesForSequence” (string array); these style the labels and sequence of the current RNA molecule respectively. Finally, the optional property “basePairs” allows for specification of base-pairs which lay strictly within this RNA molecule. They are structured as described above; however, properties “rnaMoleculeName1” and “rnaMoleculeName2” should be omitted."
            }
          ]
        },
        {
          "id": "json-schema-label",
          "title": "Label",
          "content": [
            {
              "type": "paragraph",
              "text": "The only required property of each label object is “residueIndex” (integer), which must match a nucleotide within the current RNA molecule’s “sequence” array object. The optional properties of each label object are “labelContent” and “labelLine.” Note that these are strictly independent of each other."
            },
            {
              "type": "paragraph",
              "text": "The “labelContent” object details the position and content of the text label; it has the following required properties: “label” (string), “x” (floating-point number) and “y” (floating-point number)."
            },
            {
              "type": "paragraph",
              "text": "The “labelLine” object details the 2D cartesian coordinates of a polyline; it has the only one required property: “points” (array). The “points” property must contain two or more points. Each point object requires the following properties: “x” (floating-point number) and “y” (floating-point number).  The coordinates within label objects are absolute coordinates. This design makes repositioning label elements easier, making them independent of the nucleotide which they label."
            }
          ]
        },
        {
          "id": "json-schema-sequence",
          "title": "Nucleotide Sequence",
          "content": [
            {
              "type": "paragraph",
              "text": "The sequence array lists every nucleotide in the current RNA molecule. Each nucleotide object includes these required properties: \"residueIndex\" (integer), \"residueName\" (string), \"x\" (floating-point number), and \"y\" (floating-point number). Residue indices can begin at any integer; Exornata automatically detects the minimum index and adjusts accordingly. The \"residueName\" property supports the following values: \"5'\", \"5\", \"3'\", \"3\", \"A\", \"C\", \"G\", \"U\", and \"N\". The optional \"info\" property is a string array for passing metadata to partner tools; Exornata does not read values from this property."
            }
          ]
        },
        {
          "id": "json-schema-summary",
          "title": "Summary",
          "content": [
            {
              "type": "paragraph",
              "text": "In summary, the Exornata-React JSON schema defines a highly portable human-readable file structure designed for compatibility with partner laboratories’ visualization and analysis tools."
            }
          ]
        }
      ]
    },
    
    {
      "id": "keybindings",
      "title": "Keybindings",
      "summary": "Actions you can reach without leaving the keyboard.",
      "content": [
        {
          "type": "paragraph",
          "text": "Keyboard shortcuts speed up routine tasks. Skim the table once, then revisit as you take on more advanced edits."
        },
        {
          "type": "table",
          "headers": [
            "Shortcut",
            "Scope",
            "Behavior"
          ],
          "rows": [
            [
              "Ctrl/cmd + O",
              "Global",
              "Open the file picker (browser prompt)."
            ],
            [
              "Ctrl/cmd + S",
              "Global",
              "Trigger the save/export dialog."
            ],
            [
              "Ctrl/cmd + 0",
              "Global",
              "Reset the viewport transform."
            ],
            [
              "Leftclick",
              "Global",
              "Select constraint group."
            ],
            [
              "Rightclick",
              "Global",
              "Open properties for selected constraint group."
            ],
            [
              "Ctrl/cmd + Z",
              "Global",
              "Undo last operation."
            ],
            [
              "Ctrl/cmd + Y",
              "Global",
              "Redo last undone operation."
            ],
            [
              "Middle Click",
              "Global",
              "Freezes nucleotides in the current selection."
            ],
            [
              "Ctrl/cmd + leftclick",
              "Global",
              "When clicked on a basepair breaks that basepair and when clicked on two nucleotides creates a basepair."
            ],
            [
              "Ctrl/cmd + shift + leftclick",
              "Global",
              "Creates a new basepair between two nucleotides with repositioning."
            ],
            [
              "Shift + Click",
              "Global",
              "Repositions the selected constraint group."
            ]
          ]
        },
        {
          "type": "note",
          "variant": "info",
          "text": "Keyboard shortcuts are ignored while focus is inside editable text fields, consistent with the app's accessibility policy."
        }
      ]
    },
    {
      "id": "troubleshooting",
      "title": "Troubleshooting",
      "summary": "Resolve common issues encountered during long editing sessions.",
      "content": [
        {
          "type": "paragraph",
          "text": "If something feels off, match your symptom with the guidance below before altering the file in another tool."
        },
        {
          "type": "table",
          "headers": [
            "Symptom",
            "Likely cause",
            "Suggested fix"
          ],
          "rows": [
            [
              "Blank canvas after load",
              "Unsupported format or parse error",
              "Check browser console logs; validate against the JSON schema."
            ],
            [
              "Slow drags on large complexes",
              "Too many elements re-rendering",
              "Disable canvas grids."
            ],
            [
              "No properties in right drawer",
              "No active selection",
              "Select a constraint and click a nucleotide within that constraint group."
            ]
          ]
        }
      ]
    }
  ],
  "resources": [
    {
      "label": "Open issues",
      "url": "https://github.com/LDWLab/XRNA-React/issues",
      "description": "Report bugs or request features."
    },
    {
      "label": "RNA 2D JSON Schema",
      "url": "https://github.com/LDWLab/RNA2D-data-schema",
      "description": "Browse the source schema referenced by the guide."
    }
  ]
}